In [3]:
#Task 1 : There are three different tables as given above. Please make three dataframe in python and save them as three .csv files. From Task 2 to Task 10, use the saved .csv files only. 

# Import the pandas library for data analysis
import pandas as pd

# Specify the path to your Excel file containing the three sheets
excel_file = 'Dataframe.xlsx'

# Read the 'Project' sheet from the Excel file into a dataframe
project_df = pd.read_excel(excel_file, sheet_name='Project')

# Read the 'Employee' sheet from the Excel file into a dataframe
employee_df = pd.read_excel(excel_file, sheet_name='Employee')

# Read the 'Seniority' sheet from the Excel file into a dataframe
Seniority_df = pd.read_excel(excel_file, sheet_name='Seniority')  

# Save the Project dataframe as a CSV file without the index column
project_df.to_csv('project.csv', index=False)

# Save the Employee dataframe as a CSV file without the index column
employee_df.to_csv('employee.csv', index=False)

# Save the Designation dataframe as a CSV file without the index column
Seniority_df.to_csv('Seniority.csv', index=False)

from IPython.display import display

display(project_df)
display(employee_df)
display(Seniority_df)

      ID     Project       Cost    Status
0   A001   Project 1  1002000.0  Finished
1   A002   Project 2  2000000.0   Ongoing
2   A003   Project 3  4500000.0  Finished
3   A004   Project 4  5500000.0   Ongoing
4   A005   Project 5        NaN  Finished
5   A002   Project 6   680000.0    Failed
6   A005   Project 7   400000.0  Finished
7   A003   Project 8   350000.0    Failed
8   A001   Project 9        NaN   Ongoing
9   A003  Project 10   300000.0  Finished
10  A001  Project 11  2000000.0    Failed
11  A004  Project 12  1000000.0   Ongoing
12  A004  Project 13  3000000.0  Finished
13  A005  Project 14   200000.0  Finished

     ID             Name Gender     City  Age
0  A001       John Alter      M    Paris   25
1  A002  Alice Luxumberg      F   London   27
2  A003    Tom Sabestine      M   Berlin   29
3  A004       Nina Adgra      F  Newyork   31
4  A005        Amy Johny      F   Madrid   30

     ID  Designation Level
0  A001                  2
1  A002                  2
2  A003                  3
3  A004                  2
4  A005                  3

In [7]:
# Task 2: The cost column in the dataframe “Project” has some missing values. Your task is to compute these missing values.-- 
# -- Replace the missing values by running average. You should use the “For” loop for this task.

# Read the Project data from your CSV file
project_df = pd.read_csv('project.csv')

# Fill missing values in 'Cost' using running average (for-loop required by instructions)
total = 0 
count = 0 

for i in range(len(project_df)):
    # If cost value is missing (NaN)
    if pd.isnull(project_df.loc[i, 'Cost']):
        if count > 0:
            avg = total / count   # running average
            project_df.loc[i, 'Cost'] = avg  # replace NaN with running average
        else:
            project_df.loc[i, 'Cost'] = 0    # first NaN, set to 0
    else:
        # Add cost to total and increment count
        total += project_df.loc[i, 'Cost']
        count += 1

# display result with normal formatting
pd.set_option('display.float_format', '{:.0f}'.format)

# save back to CSV if needed for later tasks
project_df.to_csv('project.csv', index=False)

project_df

      ID     Project    Cost    Status
0   A001   Project 1 1002000  Finished
1   A002   Project 2 2000000   Ongoing
2   A003   Project 3 4500000  Finished
3   A004   Project 4 5500000   Ongoing
4   A005   Project 5 3250500  Finished
5   A002   Project 6  680000    Failed
6   A005   Project 7  400000  Finished
7   A003   Project 8  350000    Failed
8   A001   Project 9 2061714   Ongoing
9   A003  Project 10  300000  Finished
10  A001  Project 11 2000000    Failed
11  A004  Project 12 1000000   Ongoing
12  A004  Project 13 3000000  Finished
13  A005  Project 14  200000  Finished

In [14]:
# Task 3: Split the name column into "First Name" and "Last Name" and remove the old "Name" column

# Read the Project data from your CSV file
employee_df = pd.read_csv('employee.csv')

# Only do split if the 'Name' column exists
if 'Name' in employee_df.columns:
    # To Split the 'Name' column into two columns: 'First Name' and 'Last Name'
    employee_df[['First Name', 'Last Name']] = employee_df['Name'].str.split(' ', n=1, expand=True)
    # To Remove the original 'Name' column from the dataframe
    employee_df = employee_df.drop(columns=['Name'])
    # To Save the updated dataframe back to CSV for use in later steps
    employee_df.to_csv('employee.csv', index=False)

# To check output 
employee_df

     ID Gender     City  Age First Name  Last Name
0  A001      M    Paris   25       John      Alter
1  A002      F   London   27      Alice  Luxumberg
2  A003      M   Berlin   29        Tom  Sabestine
3  A004      F  Newyork   31       Nina      Adgra
4  A005      F   Madrid   30        Amy      Johny

In [20]:
# Task 4: Join all three dataframes into one single dataframe named "Final"

# Load the up-to-date employee CSV
employee_df = pd.read_csv('employee.csv')  

# Load the latest project CSV file
project_df = pd.read_csv('project.csv')  

# Load the seniority CSV file 
Seniority_df = pd.read_csv('Seniority.csv')

# Merge the project and employee dataframes on 'ID', keeping all rows from project_df
merged = pd.merge(project_df, employee_df, on='ID', how='left')

# Merge the above result with designation dataframe on 'ID', again keeping all rows
Final = pd.merge(merged, Seniority_df, on='ID', how='left')

# Remove any rows with missing values and reset the row index for a clean result
Final = Final.dropna().reset_index(drop=True)

# Show the fully merged dataframe as output
Final

,ID,Project,Cost,Status,Gender,City,Age,First Name,Last Name,Designation Level
0,A001,Project 1,1002000,Finished,M,Paris,25,John,Alter,2
1,A002,Project 2,2000000,Ongoing,F,London,27,Alice,Luxumberg,2
2,A003,Project 3,4500000,Finished,M,Berlin,29,Tom,Sabestine,3
3,A004,Project 4,5500000,Ongoing,F,Newyork,31,Nina,Adgra,2
4,A005,Project 5,3250500,Finished,F,Madrid,30,Amy,Johny,3
5,A002,Project 6,680000,Failed,F,London,27,Alice,Luxumberg,2
6,A005,Project 7,400000,Finished,F,Madrid,30,Amy,Johny,3
7,A003,Project 8,350000,Failed,M,Berlin,29,Tom,Sabestine,3
8,A001,Project 9,2061714,Ongoing,M,Paris,25,John,Alter,2
9,A003,Project 10,300000,Finished,M,Berlin,29,Tom,Sabestine,3
10,A001,Project 11,2000000,Failed,M,Paris,25,John,Alter,2
11,A004,Project 12,1000000,Ongoing,F,Newyork,31,Nina,Adgra,2
12,A004,Project 13,3000000,Finished,F,Newyork,31,Nina,Adgra,2
13,A005,Project 14,200000,Finished,F,Madrid,30,Amy,Johny,3

In [22]:
# Task 5: Add a new bonus column in the Final dataframe. Give a 5% bonus concerning project cost only to employees who have finished the projects. 

# For each row in the dataframe, if the project is 'Finished', calculate Bonus as 5% of Cost, else set Bonus to 0
Final['Bonus'] = Final.apply(
    lambda row: row['Cost'] * 0.05 if str(row['Status']).lower() == 'finished' else 0,
    axis=1 )
    
# Only display the updated table as output
Final

,ID,Project,Cost,Status,Gender,City,Age,First Name,Last Name,Designation Level,Bonus
0,A001,Project 1,1002000,Finished,M,Paris,25,John,Alter,2,50100
1,A002,Project 2,2000000,Ongoing,F,London,27,Alice,Luxumberg,2,0
2,A003,Project 3,4500000,Finished,M,Berlin,29,Tom,Sabestine,3,225000
3,A004,Project 4,5500000,Ongoing,F,Newyork,31,Nina,Adgra,2,0
4,A005,Project 5,3250500,Finished,F,Madrid,30,Amy,Johny,3,162525
5,A002,Project 6,680000,Failed,F,London,27,Alice,Luxumberg,2,0
6,A005,Project 7,400000,Finished,F,Madrid,30,Amy,Johny,3,20000
7,A003,Project 8,350000,Failed,M,Berlin,29,Tom,Sabestine,3,0
8,A001,Project 9,2061714,Ongoing,M,Paris,25,John,Alter,2,0
9,A003,Project 10,300000,Finished,M,Berlin,29,Tom,Sabestine,3,15000
10,A001,Project 11,2000000,Failed,M,Paris,25,John,Alter,2,0
11,A004,Project 12,1000000,Ongoing,F,Newyork,31,Nina,Adgra,2,0
12,A004,Project 13,3000000,Finished,F,Newyork,31,Nina,Adgra,2,150000
13,A005,Project 14,200000,Finished,F,Madrid,30,Amy,Johny,3,10000

In [11]:
# Task 6: Demote the designation level by 1, whose projects have status “fail”. Delete the employees record whose designation level is above 4.

Final.loc[Final['Status'].str.lower() == 'fail', 'Designation Level'] -= 1

# Delete records where designation level is now greater than 4
Final = Final[Final['Designation Level'] <= 4].reset_index(drop=True)

# Display output for Task 6
Final

,ID,Project,Cost,Status,Gender,City,Age,First Name,Last Name,Designation Level,Bonus
0,A001,Project 1,1002000,Finished,M,Paris,25,John,Alter,2,50100
1,A002,Project 2,2000000,Ongoing,F,London,27,Alice,Luxumberg,2,0
2,A003,Project 3,4500000,Finished,M,Berlin,29,Tom,Sabestine,3,225000
3,A004,Project 4,5500000,Ongoing,F,Newyork,31,Nina,Adgra,2,0
4,A005,Project 5,3250500,Finished,F,Madrid,30,Amy,Johny,3,162525
5,A002,Project 6,680000,Failed,F,London,27,Alice,Luxumberg,2,0
6,A005,Project 7,400000,Finished,F,Madrid,30,Amy,Johny,3,20000
7,A003,Project 8,350000,Failed,M,Berlin,29,Tom,Sabestine,3,0
8,A001,Project 9,2061714,Ongoing,M,Paris,25,John,Alter,2,0
9,A003,Project 10,300000,Finished,M,Berlin,29,Tom,Sabestine,3,15000
10,A001,Project 11,2000000,Failed,M,Paris,25,John,Alter,2,0
11,A004,Project 12,1000000,Ongoing,F,Newyork,31,Nina,Adgra,2,0
12,A004,Project 13,3000000,Finished,F,Newyork,31,Nina,Adgra,2,150000
13,A005,Project 14,200000,Finished,F,Madrid,30,Amy,Johny,3,10000

In [23]:
# Task 7: Add “Mr.” and “Mrs.” to the first name column and drop the gender column

# Check if the 'Gender' column exists in Final (avoids errors if already dropped)
if 'Gender' in Final.columns:
    # For each row, add "Mr." if gender is Male ("M"), otherwise add "Mrs." before the First Name value
    Final['First Name'] = Final.apply(
        lambda row: ('Mr. ' if str(row['Gender']).upper() == 'M' else 'Mrs. ') + str(row['First Name']),
        axis=1
    )
    # After prefixing, remove the 'Gender' column from the dataframe
    Final = Final.drop(columns=['Gender'])

# Print the updated dataframe to see the result
Final

,ID,Project,Cost,Status,City,Age,First Name,Last Name,Designation Level,Bonus
0,A001,Project 1,1002000,Finished,Paris,25,Mr. John,Alter,2,50100
1,A002,Project 2,2000000,Ongoing,London,27,Mrs. Alice,Luxumberg,2,0
2,A003,Project 3,4500000,Finished,Berlin,29,Mr. Tom,Sabestine,3,225000
3,A004,Project 4,5500000,Ongoing,Newyork,31,Mrs. Nina,Adgra,2,0
4,A005,Project 5,3250500,Finished,Madrid,30,Mrs. Amy,Johny,3,162525
5,A002,Project 6,680000,Failed,London,27,Mrs. Alice,Luxumberg,2,0
6,A005,Project 7,400000,Finished,Madrid,30,Mrs. Amy,Johny,3,20000
7,A003,Project 8,350000,Failed,Berlin,29,Mr. Tom,Sabestine,3,0
8,A001,Project 9,2061714,Ongoing,Paris,25,Mr. John,Alter,2,0
9,A003,Project 10,300000,Finished,Berlin,29,Mr. Tom,Sabestine,3,15000
10,A001,Project 11,2000000,Failed,Paris,25,Mr. John,Alter,2,0
11,A004,Project 12,1000000,Ongoing,Newyork,31,Mrs. Nina,Adgra,2,0
12,A004,Project 13,3000000,Finished,Newyork,31,Mrs. Nina,Adgra,2,150000
13,A005,Project 14,200000,Finished,Madrid,30,Mrs. Amy,Johny,3,10000

In [24]:
# Task 8: Promote designation level by 1 for the employees whose age is more than 29 years using IF condition.

Final.loc[Final['Age'] > 29, 'Designation Level'] += 1

# Show the updated dataframe
Final

,ID,Project,Cost,Status,City,Age,First Name,Last Name,Designation Level,Bonus
0,A001,Project 1,1002000,Finished,Paris,25,Mr. John,Alter,2,50100
1,A002,Project 2,2000000,Ongoing,London,27,Mrs. Alice,Luxumberg,2,0
2,A003,Project 3,4500000,Finished,Berlin,29,Mr. Tom,Sabestine,3,225000
3,A004,Project 4,5500000,Ongoing,Newyork,31,Mrs. Nina,Adgra,3,0
4,A005,Project 5,3250500,Finished,Madrid,30,Mrs. Amy,Johny,4,162525
5,A002,Project 6,680000,Failed,London,27,Mrs. Alice,Luxumberg,2,0
6,A005,Project 7,400000,Finished,Madrid,30,Mrs. Amy,Johny,4,20000
7,A003,Project 8,350000,Failed,Berlin,29,Mr. Tom,Sabestine,3,0
8,A001,Project 9,2061714,Ongoing,Paris,25,Mr. John,Alter,2,0
9,A003,Project 10,300000,Finished,Berlin,29,Mr. Tom,Sabestine,3,15000
10,A001,Project 11,2000000,Failed,Paris,25,Mr. John,Alter,2,0
11,A004,Project 12,1000000,Ongoing,Newyork,31,Mrs. Nina,Adgra,3,0
12,A004,Project 13,3000000,Finished,Newyork,31,Mrs. Nina,Adgra,3,150000
13,A005,Project 14,200000,Finished,Madrid,30,Mrs. Amy,Johny,4,10000

In [12]:
# Task 9: Calculate total project cost for each employee

# Group the DataFrame by 'ID' and 'First Name'
TotalProjCost = Final.groupby(['ID', 'First Name'])['Cost'].sum().reset_index()

# Rename the 'Cost' column to 'TotalProjCost' for clarity
TotalProjCost = TotalProjCost.rename(columns={'Cost': 'TotalProjCost'})

# Show only the resulting summary table as the output
TotalProjCost

     ID First Name  TotalProjCost
0  A001       John        5063714
1  A002      Alice        2680000
2  A003        Tom        5150000
3  A004       Nina        9500000
4  A005        Amy        3850500

In [16]:
# Task 10: Print all the employee details whose city name contains the letter “o” in it

# Creating a new dataframe containing only rows where 'City' includes the letter 'o' 
filtered = Final[Final['City'].str.contains('o', case=False)]

# Display the filtered table only
filtered

,ID,Project,Cost,Status,Gender,City,Age,First Name,Last Name,Designation Level
1,A002,Project 2,2000000,Ongoing,F,London,27,Alice,Luxumberg,2
3,A004,Project 4,5500000,Ongoing,F,Newyork,31,Nina,Adgra,2
5,A002,Project 6,680000,Failed,F,London,27,Alice,Luxumberg,2
11,A004,Project 12,1000000,Ongoing,F,Newyork,31,Nina,Adgra,2
12,A004,Project 13,3000000,Finished,F,Newyork,31,Nina,Adgra,2